[
  {
    "product_id": 1,
    "product_title": "Samsung Galaxy S23",
    "product_image": "https://i.ibb.co/wkC0vsS/in-galaxy-s23-s911-446648-sm-s911blibins-536009999.jpg",
    "category": "Mobile",
    "price": 699.99,
    "description": "The Samsung Galaxy S23 is a premium flagship smartphone designed for those who demand the best in performance and photography. With its sleek glass and metal design, it delivers a truly premium feel. Powered by the Snapdragon 8 Gen 2 processor, it ensures lightning-fast performance, while the dynamic AMOLED display offers vivid colors and deep contrast. The triple-lens camera system captures professional-quality photos in both daylight and low-light conditions, making it ideal for content creators and mobile photographers.",
    "specification": ["8GB RAM", "128GB Storage", "5G", "AMOLED Display"],
    "availability": true,
    "rating": 4.6,
    "other_field": "1 Year Warranty"
  },
  {
    "product_id": 2,
    "product_title": "Apple iPhone 14 Pro",
    "product_image": "https://i.ibb.co/8DRVkTyz/download.jpg",
    "category": "iPhone",
    "price": 999.99,
    "description": "The Apple iPhone 14 Pro is one of the most advanced iPhones ever built, featuring Apple’s cutting-edge A16 Bionic chip that delivers smooth performance for gaming, photography, and productivity. Its stunning Super Retina XDR display introduces Dynamic Island, a unique interactive notification and control area. With a 48MP main camera, it redefines smartphone photography by delivering sharp detail and cinematic-quality video recording. Built with surgical-grade stainless steel and durable ceramic shield glass, it ensures long-lasting reliability.",
    "specification": ["6GB RAM", "256GB Storage", "5G", "Super Retina XDR"],
    "availability": true,
    "rating": 4.8,
    "other_field": "Face ID"
  },
  {
    "product_id": 3,
    "product_title": "Dell XPS 13",
    "product_image": "https://i.ibb.co/p6n1p2MY/download-1.jpg",
    "category": "Laptop",
    "price": 1199.99,
    "description": "The Dell XPS 13 is an ultra-thin and lightweight laptop that blends performance, portability, and premium build quality. With its virtually borderless InfinityEdge display, users get an immersive viewing experience whether working, streaming, or browsing. The Intel i7 processor combined with 16GB RAM ensures smooth multitasking and productivity. Its long-lasting battery and advanced cooling design make it perfect for professionals, students, and creators on the go. The XPS 13 remains a gold standard in premium ultrabooks.",
    "specification": ["Intel i7", "16GB RAM", "512GB SSD", "13.4 inch FHD+"],
    "availability": true,
    "rating": 4.7,
    "other_field": "Backlit Keyboard"
  },
  {
    "product_id": 4,
    "product_title": "MacBook Air M2",
    "product_image": "https://i.ibb.co/vvXznfnn/6efd6ab0-e5d1-11ec-be6c-b2fe04160b9a-cf.webp",
    "category": "Laptop",
    "price": 1249.99,
    "description": "Apple’s MacBook Air M2 is the ultimate thin and light laptop, redesigned with a larger Liquid Retina display and powered by the lightning-fast Apple M2 chip. It delivers incredible performance for both everyday use and professional workloads like video editing, coding, and graphic design. Despite its slim profile, it offers powerful speakers, an improved camera for video calls, and a long-lasting battery that can handle an entire workday. With macOS optimization, the MacBook Air M2 is both powerful and energy-efficient.",
    "specification": ["Apple M2", "8GB RAM", "256GB SSD", "13.6 inch Liquid Retina"],
    "availability": true,
    "rating": 4.9,
    "other_field": "Touch ID"
  },
  {
    "product_id": 5,
    "product_title": "OnePlus 11 5G",
    "product_image": "https://i.ibb.co/GQvNKB3w/salami-share.jpg",
    "category": "Mobile",
    "price": 649.99,
    "description": "The OnePlus 11 5G is a high-performance flagship device known for its speed and photography capabilities. Featuring a 120Hz AMOLED display, it provides smooth scrolling and vibrant colors. The phone is powered by Snapdragon’s latest processor, making it ideal for gaming and multitasking. Its Hasselblad-tuned camera captures true-to-life photos with exceptional clarity. With ultra-fast 100W charging, the OnePlus 11 can go from 0% to 100% in minutes, ensuring users spend more time enjoying and less time charging.",
    "specification": ["12GB RAM", "256GB Storage", "5G", "120Hz AMOLED"],
    "availability": true,
    "rating": 4.5,
    "other_field": "Fast Charging 100W"
  },
  {
    "product_id": 6,
    "product_title": "HP Pavilion 15",
    "product_image": "https://i.ibb.co/93ztDYw4/w100-hero-banner-v1.webp",
    "category": "Laptop",
    "price": 799.99,
    "description": "The HP Pavilion 15 is a reliable and affordable laptop designed for everyday computing. With its powerful Intel i5 processor and 8GB RAM, it is well-suited for students and professionals handling work, study, and light creative tasks. The laptop features a vibrant 15.6-inch FHD display that enhances movie streaming and browsing experiences. With Windows 11 pre-installed, it offers the latest productivity tools and security. Its slim design and long-lasting battery make it a convenient choice for both office and home use.",
    "specification": ["Intel i5", "8GB RAM", "512GB SSD", "15.6 inch FHD"],
    "availability": false,
    "rating": 4.2,
    "other_field": "Windows 11"
  },
  {
    "product_id": 7,
    "product_title": "Apple iPhone SE (2022)",
    "product_image": "https://i.ibb.co/C3st85cP/apple-iphone-se-xe1d-1920.webp",
    "category": "iPhone",
    "price": 429.99,
    "description": "The iPhone SE (2022) combines Apple’s powerful A15 Bionic chip with a compact and familiar design. It’s the most affordable iPhone that still delivers flagship-level performance, capable of running demanding apps and games with ease. The 4.7-inch Retina HD display provides crisp visuals, while the durable build makes it long-lasting. With 5G connectivity, users get faster downloads and streaming. Its Touch ID fingerprint sensor offers quick authentication, making it a reliable and budget-friendly iPhone option.",
    "specification": ["4GB RAM", "128GB Storage", "5G", "4.7 inch Retina HD"],
    "availability": true,
    "rating": 4.4,
    "other_field": "Water Resistant"
  },
  {
    "product_id": 8,
    "product_title": "Anker 20W Fast Charger",
    "product_image": "https://i.ibb.co/fdK9c69r/713-Hf-Xw-QZu-L-UF1000-1000-QL80.jpg",
    "category": "Charger",
    "price": 24.99,
    "description": "The Anker 20W Fast Charger is a compact and highly efficient charging solution for modern smartphones and tablets. With Power Delivery technology, it ensures your iPhone or Android device charges at optimal speed, saving valuable time. Its lightweight design makes it travel-friendly, while built-in protection safeguards against overheating, short-circuiting, and over-voltage. Whether at home, office, or on the go, this charger is perfect for keeping your devices powered up quickly and safely.",
    "specification": ["20W Power Delivery", "USB-C", "Lightweight"],
    "availability": true,
    "rating": 4.6,
    "other_field": "Overheat Protection"
  },
  {
    "product_id": 9,
    "product_title": "Samsung 65W Trio Charger",
    "product_image": "https://i.ibb.co/rfftKwtr/in-65w-power-adapter-trio-ep-t6530-ep-t6530nbngin-539529052.webp",
    "category": "Charger",
    "price": 49.99,
    "description": "The Samsung 65W Trio Charger is a versatile charging hub designed to power up multiple devices simultaneously. With two USB-C ports and one USB-A port, it can charge a smartphone, tablet, and laptop all at once. Its compact size makes it easy to carry, while intelligent charging technology adjusts output for each device, ensuring safety and efficiency. Built with premium materials, it provides durability and reliability for daily use. Ideal for multitaskers and tech enthusiasts.",
    "specification": ["65W Output", "USB-C x2", "USB-A x1"],
    "availability": true,
    "rating": 4.7,
    "other_field": "Multi-device Support"
  },
  {
    "product_id": 10,
    "product_title": "Sony WH-1000XM5",
    "product_image": "https://i.ibb.co/kgDVBfKH/61-ULAZmt9-NL-UF1000-1000-QL80.jpg",
    "category": "Others",
    "price": 399.99,
    "description": "The Sony WH-1000XM5 headphones deliver industry-leading noise cancellation, making them perfect for travel, work, and leisure. Designed with comfort in mind, they feature soft ear cushions and a lightweight build for all-day wear. The advanced processor provides superior sound quality with deep bass and crisp highs. With up to 30 hours of battery life, you can enjoy music without interruptions. Intuitive touch controls and voice assistant compatibility add to the convenience, making it one of the best headphones on the market.",
    "specification": ["ANC", "Bluetooth 5.2", "30 Hours Battery"],
    "availability": true,
    "rating": 4.9,
    "other_field": "Touch Controls"
  },
  {
    "product_id": 11,
    "product_title": "Apple AirPods Pro 2",
    "product_image": "https://i.ibb.co/ZpvtDx2Y/Air-Pods-Pro-2-PDP-Image-Position-1-en-IN.webp",
    "category": "Others",
    "price": 249.99,
    "description": "The Apple AirPods Pro 2 bring a superior wireless audio experience with improved active noise cancellation and adaptive transparency modes. With spatial audio, users can enjoy immersive sound that feels like it’s coming from all around. The redesigned MagSafe charging case offers better battery life and easy wireless charging. Their comfortable, sweat-resistant design makes them perfect for workouts, travel, or casual listening. Seamless integration with Apple devices ensures quick pairing and effortless switching between iPhone, iPad, and Mac.",
    "specification": ["ANC", "Adaptive Transparency", "MagSafe Charging Case"],
    "availability": false,
    "rating": 4.8,
    "other_field": "Sweat & Water Resistant"
  },
  {
    "product_id": 12,
    "product_title": "Logitech MX Master 3S",
    "product_image": "https://i.ibb.co/nqCFkdMV/mx-master-3s-crop.webp",
    "category": "Others",
    "price": 99.99,
    "description": "The Logitech MX Master 3S is an advanced wireless mouse designed for productivity and precision. Featuring ultra-fast MagSpeed scrolling, it allows users to scroll through long documents and web pages in seconds. With its ergonomic design, it provides maximum comfort even during long working hours. The high-precision 8K DPI sensor ensures smooth tracking on virtually any surface, including glass. With multi-device and multi-OS compatibility, professionals can seamlessly switch between devices, making it the ultimate tool for efficiency.",
    "specification": ["Wireless", "USB-C Rechargeable", "8K DPI Sensor"],
    "availability": true,
    "rating": 4.7,
    "other_field": "Multi-Device Control"
  }
]
